app/controllers/answer_controller.rb

INSERT INTO "answers" ("person_id", "question_id", "answer", "start_time", "end_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    answer = Answer.new
    answer.person_id = params['person_id']
    answer.question_id = params['question_id']
    answer.answer = params['answer']
    answer.start_time = params['start_time']
    answer.end_time = params['end_time']
    answer.save!